src/InformationRegisters/Базар_ПредопределенныеЭлементыРасширения/Базар_ПредопределенныеЭлементыРасширения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Базар_ПредопределенныеЭлементыРасширения</name>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.ВидыВзаиморасчетов</types>
      <types>CatalogRef.ВидыНоменклатуры</types>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ПредопределенныеЭлементыРасширенияСервер/Module.bsl
Функция ПредопределенноеЗначениеРасширения(ТипОбъекта, ИмяОбъекта, Код) Экспорт
	
	Результат = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(ТипОбъекта)
	 ИЛИ НЕ ЗначениеЗаполнено(ИмяОбъекта) 
	 ИЛИ НЕ ЗначениеЗаполнено(Код) тогда
		Возврат Результат;
	КонецЕсли;
	
	ИдентификаторМетаданных = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", ТипОбъекта + "." + ИмяОбъекта);
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторМетаданных) тогда
		ИдентификаторМетаданных = Справочники.ИдентификаторыОбъектовРасширений.НайтиПоРеквизиту("ПолноеИмя", ТипОбъекта + "." + ИмяОбъекта);
		Если НЕ ЗначениеЗаполнено(ИдентификаторМетаданных) тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ПредопределенныеЭлементыРасширения.Ссылка КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.Базар_ПредопределенныеЭлементыРасширения КАК ПредопределенныеЭлементыРасширения
	               |ГДЕ
	               |	ПредопределенныеЭлементыРасширения.Код = &Код
	               |	И ПредопределенныеЭлементыРасширения.ОбъектМетаданных = &ИдентификаторМетаданных
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПредопределенныеЭлементыРасширения.Ссылка";
	
	Запрос.УстановитьПараметр("ИдентификаторМетаданных", ИдентификаторМетаданных);
	Запрос.УстановитьПараметр("Код", Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() тогда
		ПредопределенныйРеквизит = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПредопределенныйРеквизит;
	
КонецФункции
